app/controllers/admin/projects_controller.rb

  def index
    @projects = Project.all.order(created_at: :desc)
---
SELECT "projects".* FROM "projects" ORDER BY "projects"."created_at" DESC