app/controllers/admin/skills_controller.rb

  def index
    @skills = Skill.all.order(:category, :name)
---
SELECT "skills".* FROM "skills" ORDER BY "skills"."category" ASC, "skills"."name" ASC

  def update
    if @skill.update(skill_params)
---
UPDATE "skills" SET "proficiency" = $1, "updated_at" = $2 WHERE "skills"."id" = $3  [["proficiency", 3], ["updated_at", "2025-08-29 15:03:51.648609"], ["id", 1]]

  def set_skill
    @skill = Skill.find(params[:id])
---
SELECT "skills".* FROM "skills" WHERE "skills"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]