app/views/portfolio/index.html.erb

    <h2>🏰 Projects</h2>
    <p class="lead">学習アウトプットを中心に、Railsとフロントの基礎を鍛えた<%= Project.count %>作。</p>
    <div class="grid">
      <% Project.all.each do |project| %>
---
SELECT "projects".* FROM "projects"
SELECT COUNT(*) FROM "projects"

    <div class="skills" data-reveal>
      <% Skill.all.each do |skill| %>
---
SELECT "skills".* FROM "skills"